#define  _CRT_SECURE_NO_WARNINGS  1
/*	算法：桶排序
	时间：2021.04.15
	目的：输入数字的个数5及每一个数，排序后输出
*/
#include<stdio.h>

int main()
{
	int a[11], i, j,t;
	for (i = 0; i <= 10; i++)
		a[i] = 0;//将数组每个元素初始化为0
	for (i = 1; i <= 5; i++)//循环读入五个数
	{
		scanf("%d", &t);//把每一个数读到变量t中
		a[t]++;//进行计数
	}
	for (i = 0; i <= 10; i++)//依次判断a[0]-a[10]  从大到小排序可改为for(i=10;i>=0;i--)
		for (j = 1; j <= a[i]; j++)//出现了几次就打印几次
			printf("%d ", i);
	getchar(); getchar();
	//这里的getchar()用来暂停程序；以便查看程序输出的内容
	//也可以用system("pause");等来替代
	return 0;
}
/*在VS2019中的结果为
-------------------------
5 3 5 2 8
2 3 5 5 8
-------------------------
*/